HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
// --------------------------------------------------------------------------------------------------------------------
//      ____    ______   _____
//     /  _/___/_  __/  /__  / ____  ____
//     / // __ \/ /       / / / __ \/ __ \  P L A Y G R O U N D
//   _/ // /_/ / /       / /_/ /_/ / /_/ /
//  /___/\____/_/       /____|____/\____/   (c) 2025 - 2026 Holger Freudenreich under the MIT licence.
//
// --------------------------------------------------------------------------------------------------------------------
// Firmware for ESP8266 and ESP32 Microcontrollers
// --------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------
// Includes
// --------------------------------------------------------------------------------------------------------------------
#include "ConnectionSettings.hpp"
#include "DebugHelper.hpp"
#include "Defines.hpp"
#include "pocos/Microcontroller.hpp"
#include "pocos/Topic.hpp"
#include "pocos/TopicLink.hpp"

#include <Arduino.h>
#include <ArduinoJson.h>
#include <WiFi.h>
#include <list>

#ifdef ERASE_FLASH
#include "nvs_flash.h"
#endif

#ifdef USE_REST_SERVER
#include "WebServer.h"

#include <HTTPClient.h>
// Web server running on port 80
WebServer webServer(80);
#endif

// Rotary encoder
#ifdef USE_HW040
#include "HW040/HW040Handling.hpp"
#endif

#ifdef USE_STEPPER_MOTOR
#include "StepperMotor.hpp"
IotZoo::StepperMotor* stepperMotor = nullptr;
#endif

#ifdef USE_LED_AND_KEY
#include "TM1638.hpp"
IotZoo::TM1638* tm1638 = nullptr;
#endif

#ifdef USE_WS2818
#include "WS2818.hpp"
IotZoo::WS2818* ws2812 = nullptr;
#ifdef USE_WS2818_PIXEL_MATRIX
#include "PixelMatrix.hpp"
#endif
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
#include "BLEHeartRateSensor.hpp"
IotZoo::HeartRateSensor* heartRateSensor = nullptr;
void                     connectToHeartRateSensor(int advertisingTimeout = 30);
#endif

#ifdef USE_HC_SR501
#include "HRSR501Handling.hpp"
IotZoo::HRSR501Handling motionDetectorsHrsc501Handling;
#endif

#ifdef USE_RD_03D
#include "Rd03D.hpp"
IotZoo::Rd03D* rd03d = nullptr;
#endif

#ifdef USE_BUZZER
#include "Buzzer.hpp"
IotZoo::Buzzer* buzzer = nullptr;
#endif

#ifdef ARDUINO_ESP32_DEV
#include "Settings.hpp"
using namespace IotZoo;
Settings* settings = nullptr;
#endif

#ifdef USE_TRAFFIC_LIGHT_LEDS
#include "TrafficLight.hpp"
std::vector<TrafficLight> trafficLightLeds{};
#endif

#ifdef USE_REMOTE_GPIOS
#include "RemoteGpio.hpp"
std::vector<RemoteGpio> remoteGpios{};
#endif

#ifdef USE_HB0014
const int     digitalPinInfraredLed   = 34;
int           digitalValueInfrared    = 0; // digital readings
int           digitalValueOldInfrared = 0;
unsigned long lastMillisInfrared      = millis();
#endif

#ifdef USE_OLED_SSD1306
#include "./displays/SSD1306.hpp"
OledSsd1306Display* oled1306 = nullptr;
#endif

#ifdef USE_LCD_160X
#include "./displays/LCDDisplay.hpp"
LcdDisplay* lcdDisplay = nullptr;
#endif

#ifdef USE_HT1621
#include "./displays/HT1621.hpp"
IotZoo::HT1621* ht1621 = nullptr;
#endif

#ifdef USE_KEYPAD
#include "ButtonMatrixHandling.hpp"
using namespace IotZoo;
IotZoo::ButtonMatrixHandling buttonMatrixHandling;
#endif

#ifdef ESP8266
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#else
#include <WiFi.h>
#endif

#ifdef USE_BUTTON
#include "ButtonHandling.hpp"
ButtonHandling buttonHandling;
#endif

#ifdef USE_KY025
#include "ReedContactKY025.hpp"
KY025* ky025 = nullptr;
#endif

#ifdef USE_AUDIO_STREAMER
#include "AudioStreamer.hpp"
AudioStreamer* audioStreamer = nullptr;
#endif

#ifdef USE_GPS
#include "Gps.hpp"
Gps* gps = nullptr;
#endif

#ifdef USE_SWITCH
#include "Switch.hpp"
std::vector<Switch> switches{};
#endif

enum class DayMode
{
    Unknown = -1,
    Night   = 0,
    Day     = 1,
};

// --------------------------------------------------------------------------------------------------------------------
// Global variables
// --------------------------------------------------------------------------------------------------------------------
String firmwareVersion = "0.2.5";

bool          doRestart         = false;
unsigned long aliveCounter      = 0;
unsigned long lastAliveTime     = 0;
unsigned long lastLoopStartTime = millis();

unsigned long lastServerAliveMillis = millis();
long          loopCounter           = 0;
long          loopDurationMs        = 0;

static const uint8_t LED_BUILTIN = 2;

DayMode dayMode = DayMode::Unknown;

// --------------------------------------------------------------------------------------------------------------------
// usings
// --------------------------------------------------------------------------------------------------------------------
using namespace std;
using namespace IotZoo;

String macAddress;

bool topicsRegistered = false;

/// @brief Restarts the microcontroller.
void restart()
{
    debug("*** RESTART NOW!!! ***");
    ESP.restart();
}

/// @brief Get the MAC Address of the microcontroller.
/// @return
String getMacAddress()
{
    // It would be even possible to set the MAC address!
    macAddress = WiFi.macAddress();
    debug("MAC: " << macAddress);
    return macAddress;
}

/// @brief Gets the board type of the microcontroller.
/// @return
String identifyBoard()
{
    // do not change because this is part of the MQTT topic. The MQTT topic is case sensitive!
#ifdef ARDUINO_ESP32_DEV
    return "esp32";
#else
    return "esp8266";
#endif
}

#ifdef USE_DS18B20
#include "DS18B20.hpp"
IotZoo::DS18B20* ds18B20SensorManager = nullptr;
#endif

#ifdef USE_HW507
#include "HW507.hpp"
IotZoo::HW507* hw507HumiditySensor = nullptr;
#endif

#ifdef USE_MQTT
#include "MqttClient.hpp"
MqttClient* mqttClient = nullptr;
#endif

#ifdef USE_INTERNAL_MQTT
#include "./InternalMqtt/InternalMqtt.h"
static InternalMqttBroker* internalBroker           = nullptr;
static InternalMqttClient* globalInternalMqttClient = nullptr;
#endif // USE_INTERNAL_MQTT

#ifdef USE_TM1637_4
#include "./displays/TM1637/TM1637_4_Handling.hpp"
IotZoo::TM1637_4_Handling* tm1637_4Handling;
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
#include "./displays/TM1637/TM1637_6_Handling.hpp"
IotZoo::TM1637_6_Handling* tm1637_6Handling;
#endif // USE_TM1637_6

#ifdef USE_MAX7219
#include "./displays/Max7219.hpp"
Max7219* max7219;
#endif // USE_MAX7219

#ifdef USE_ANALOG_INPUT_PIN
#include "AnalogInputPin.hpp"
std::vector<AnalogInputPin> analogInputPins;
#endif // USE_ANALOG_INPUT_PIN

#if defined(USE_MQTT)
const String NamespaceNameFallback = "iotzoo";

String getNamespaceAndProjectNameForTopic()
{
    String namespaceName = settings->getNamespaceName(NamespaceNameFallback);
    if (namespaceName.length() > 0)
    {
        namespaceName += "/";
    }
    String projectName = settings->getProjectName(ProjectNameFallback);
    if (projectName.length() > 0)
    {
        projectName += "/";
    }
    return namespaceName + projectName;
}

/// @brief Get the base MQTT Topic.
/// @return
String getBaseTopic()
{
    return getNamespaceAndProjectNameForTopic() + identifyBoard() + "/" + macAddress;
}

void publishError(const String& errMsg)
{
    String topic = getBaseTopic() + "/error";
    mqttClient->publish(topic, errMsg);
}

bool deserializeStaticJsonAndPublishError(JsonDocument& jsonDocument, const String& json)
{
    DeserializationError error = deserializeJson(jsonDocument, json);
    if (error)
    {
        if (DeserializationError::NoMemory == error)
        {
            publishError("Max data length exeeded! (" + String(json.length()) + " > " + String(jsonDocument.capacity()) +
                         ") Error: " + String(error.c_str()));
        }
        else
        {
            publishError("DeserializeJson() of '" + json + "' failed: " + String(error.c_str()));
        }

