HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
    String jsonMicrocontroller = serializeMicrocontroller();
    jsonMicrocontroller.remove(jsonMicrocontroller.length() - 1);
    jsonMicrocontroller += ", \"KnownTopics\": [";

    int size = topics.size();
    if (size > 64) // We are limited to 16 kb. This is the set buffer size of the MQTT client. If this size is exceeded,
                   // the message will not be delivered.
    {
        Serial.println("sorry, to much data. We are limited to 16 kb.");
        size = 64;
    }

    topics.begin();

    for (int index = 0; index < size; index++)
    {
        auto topic = topics.begin();
        std::advance(topic, index);

        String jsonTopic = serializeTopic(*topic);

        if (index != size - 1)
        {
            jsonTopic += ",\r\n";
        }

        jsonMicrocontroller += jsonTopic;
    }
    jsonMicrocontroller += "] }";

    Serial.println(jsonMicrocontroller);
    if (mqttClient->publish(topicRegisterMicrocontroller, jsonMicrocontroller,
                            false)) // retain should be false
    {
        Serial.println("Known Topics successfully sent to the IOTZOO client.");
    }
    else
    {
        publishError("Unable to send topic " + topicRegisterMicrocontroller);
    }

    if (topics.size() > 64)
    {
        Serial.println("Forwarding the remaining topics");
        for (int index = 64; index < topics.size(); index++)
        {
            auto topic = topics.begin();
            std::advance(topic, index);

            pushTopicToIotZooClient(*topic);
        }
    }
}

void publishDeviceConfigurations()
{
    try
    {
        String topicDevices        = getBaseTopic() + "/device_config";
        String deviceConfiguration = settings->loadDeviceConfigurations();
        Serial.println("publishing device configuration: " + deviceConfiguration);
        mqttClient->publish(topicDevices, deviceConfiguration);
    }
    catch (const std::exception& e)
    {
        Serial.println(e.what());
    }
}

void publishErrorMessage(const String& errorMessage)
{
    String topicError = getBaseTopic() + "/error";
    mqttClient->publish(topicError, errorMessage);
}

/// @brief Create Json for alive message.
/// @return Json for alive message
String createAliveJson()
{
    StaticJsonDocument<4096> jsonDocument; // on stack
    // DynamicJsonDocument jsonDocument(4096); // on heap

    AddMicrocontrollerNestedJsonObject(&jsonDocument);
    AddAliveNestedJsonObject(&jsonDocument);
    AddSupportedDevicesNestedJsonObject(&jsonDocument);

    String json;
    serializeJson(jsonDocument, json);
    return json;
}
#endif

// ------------------------------------------------------------------------------------------------
// Periodically send an alive message.
// ------------------------------------------------------------------------------------------------

#if defined(USE_MQTT)
void publishAliveMessage()
{
    Serial.println("publishAliveMessage");

    aliveCounter++;
    String topicAlive = getBaseTopic() + "/alive";
    String json       = createAliveJson();
    mqttClient->publish(topicAlive, json);

    lastAliveTime = millis();
}

/// @brief IotZoo acknowledged the alive message.
/// @param rawData
void onAliveAck(const String& rawData)
{
    Serial.println("Received alive_ack: " + rawData + ", millis: " + String(millis()));

    lastServerAliveMillis = millis();
    if (rawData.length() > 0)
    {
        if (rawData != "0")
        {
            if (settings->getAliveAckLedMode() == 1)
            {
                digitalWrite(LED_BUILTIN, HIGH); // turn the LED on.
            }
            else if (settings->getAliveAckLedMode() == 2)
            {
                if (dayMode == DayMode::Day)
                {
                    digitalWrite(LED_BUILTIN, HIGH); // turn the LED on.
                }
            }
        }
    }
}

// --------------------------------------------------------------------------------------------------------------------
/// @brief /esp32/<mac>/status requested (from IoTZooClient) via MQTT.
/// @param rawData

void onStatusRequested(const String& status)
{
    Serial.println("*** Status requested: " + status);
    if (status == "device_config")
    {
        publishDeviceConfigurations();
    }
    else if (status == "alive")
    {
        publishAliveMessage();
    }
    else
    {
        publishErrorMessage("Do not know what status you want: " + status);
    }
}

// publish an answer to getBaseTopic() + "/settings/load".
void onLoadAndPublishConfigurationByKey(const String& key)
{
    String topic = getBaseTopic() + "/settings/key";
    if (key.length() == 0)
    {
        publishError("key missing!");
        return;
    }

    try
    {
        Serial.println("Loading configuration with key '" + key + "'");

        String value = settings->loadConfiguration(key);
        String json  = "{ \"key\": \"" + key + "\", \"data\": \"" + value + "\" }";
        mqttClient->publish(topic, json);
    }
    catch (const std::exception& e)
    {
        publishError(String(e.what()));
    }
};

#endif

// ------------------------------------------------------------------------------------------------
// Is called when MQTT connection is established.
// ------------------------------------------------------------------------------------------------

#ifdef USE_MQTT
void onConnectionEstablished() // do not rename! This method name is forced in EspMQTTClient.h. I do not like this.
{
    Serial.println("onMqttConnectionEstablished! baseTopic: " + getBaseTopic());

    String topicDeviceStatus = getBaseTopic() + "/status";
    mqttClient->subscribe(topicDeviceStatus, onStatusRequested);
    mqttClient->subscribe(macAddress + "/status", onStatusRequested);
    mqttClient->subscribe(getBaseTopic() + "/alive_ack", onAliveAck);

#ifdef USE_LCD_160X
    if (nullptr != lcdDisplay)
    {
        lcdDisplay->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_WS2818
    // It seems that the library only supports one light strip!
    if (nullptr != ws2812)
    {
        ws2812->onMqttConnectionEstablished();
    }
    else
    {
        Serial.println("ws2812 is nullptr!");
    }
#endif

#ifdef USE_HW040
    hw040Handling.onMqttConnectionEstablished(mqttClient, getBaseTopic());
#endif

#ifdef USE_STEPPER_MOTOR
    if (nullptr != stepperMotor)
    {
        stepperMotor->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_OLED_SSD1306
    if (nullptr != oled1306)
    {
        oled1306->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_STEPPER_MOTOR
    if (nullptr != stepperMotor)
    {
        stepperMotor->onMqttConnectionEstablished();
    }
#endif

#ifdef USE_BUTTON
    buttonHandling.onMqttConnectionEstablished();
#endif

#ifdef USE_ANALOG_INPUT_PIN
    for (auto& analogInputPin : analogInputPins)
    {
        analogInputPin.onMqttConnectionEstablished();
    }
#endif // USE_ANALOG_INPUT_PIN

