HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
                    String targetPayload = topicLinkVariant["TargetPayload"].as<String>();
                    // Example: { "Operator": ">", "Value": "130"}
                    String expression = topicLinkVariant["Expression"].as<String>();

                    topicLinks->emplace_back(triggeringTopic, expression, targetTopic, targetPayload);
                }
#ifdef USE_BUTTON
                if (deviceType == "Button")
                {
                    int buttonPin = arrPins[0]["MicrocontrollerGpoPin"];

                    buttonHandling.addDevice(deviceIndex, settings, mqttClient, getBaseTopic(), buttonPin);

                    Serial.println("Button initialized.");
                }
#endif // USE_BUTTON

#ifdef USE_KY025
                if (deviceType == "Reed-Contact")
                {
                    int dataPin = arrPins[0]["MicrocontrollerGpoPin"];

                    u16_t intervalMs = 10000;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];
                        if (propertyName == "IntervalMs")
                        {
                            intervalMs = property["Value"];
                        }
                    }

                    ky025 = new KY025(deviceIndex, settings, mqttClient, getBaseTopic(), intervalMs, dataPin);
#ifdef USE_INTERNAL_MQTT
                    ky025->setTopicLinks(*topicLinks);
                    ky025->setInternalMqttClient(globalInternalMqttClient);
#endif // USE_INTERNAL_MQTT
                    Serial.println("Reed contact KY-025 initialized.");
                }
#endif // USE_BUTTON

#ifdef USE_AUDIO_STREAMER
                if (deviceType == "INMP441")
                {
                    int pinSd  = arrPins[0]["MicrocontrollerGpoPin"];
                    int pinWs  = arrPins[1]["MicrocontrollerGpoPin"];
                    int pinSck = arrPins[2]["MicrocontrollerGpoPin"];

                    u8_t  features = AudioStreamerFeatures::Undefined;
                    u16_t minRms   = 400;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];

                        if (propertyName == "AllowStreaming")
                        {
                            bool allowStreaming = property["Value"] == "true";
                            if (allowStreaming)
                            {
                                features |= AudioStreamerFeatures::Streaming;
                            }
                        }
                        else if (propertyName == "AllowSoundLevel")
                        {
                            bool allowSoundLevel = property["Value"] == "true";
                            if (allowSoundLevel)
                            {
                                features |= AudioStreamerFeatures::SoundLevelRms;
                                features |= AudioStreamerFeatures::SoundLevelDecibel;
                            }
                        }
                        else if (propertyName == "MinRms")
                        {
                            u16_t minRms = property["Value"];
                        }
                    }

                    audioStreamer =
                        new IotZoo::AudioStreamer(deviceIndex, settings, mqttClient, getBaseTopic(), features, minRms, pinSd, pinWs, pinSck);

                    Serial.println("AudioStreamer initialized.");
                }
#endif // USE_AUDIO_STREAMER

#ifdef USE_GPS
                if (deviceType == "GPS")
                {
                    Serial.println("GPS is in the configuration.");
                    int pinRx = arrPins[0]["MicrocontrollerGpoPin"];
                    int pinTx = arrPins[1]["MicrocontrollerGpoPin"];

                    gps = new Gps(deviceIndex, settings, mqttClient, getBaseTopic(), pinRx, pinTx);
                }
#endif // USE_GPS

#ifdef USE_BUZZER
                if (deviceType == "Buzzer")
                {
                    uint8_t buzzerPin = arrPins[0]["MicrocontrollerGpoPin"];
                    uint8_t ledPin    = arrPins[1]["MicrocontrollerGpoPin"];

                    buzzer = new IotZoo::Buzzer(deviceIndex, settings, mqttClient, getBaseTopic(), buzzerPin, ledPin);

                    Serial.println("Buzzer initialized.");
                }
#endif // USE_BUZZER

#ifdef USE_HT1621
                if (deviceType == "HT1621")
                {
                    uint8_t csPin        = arrPins[0]["MicrocontrollerGpoPin"];
                    uint8_t wsPin        = arrPins[1]["MicrocontrollerGpoPin"];
                    uint8_t dataPin      = arrPins[2]["MicrocontrollerGpoPin"];
                    uint8_t backlightPin = arrPins[3]["MicrocontrollerGpoPin"];

                    ht1621 = new IotZoo::HT1621(deviceIndex, settings, mqttClient, getBaseTopic(), csPin, wsPin, dataPin, backlightPin);
                    if (nullptr != ht1621)
                    {
                        Serial.println("HT1621 6 digit LED Display initialized.");
                    }
                }
#endif // USE_HT1621

#ifdef USE_MAX7219
                if (deviceType == "MAX7219")
                {
                    uint8_t dataPin         = arrPins[0]["MicrocontrollerGpoPin"];
                    uint8_t clkPin          = arrPins[1]["MicrocontrollerGpoPin"];
                    uint8_t csPin           = arrPins[2]["MicrocontrollerGpoPin"];
                    uint8_t numberOfDevices = 1;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];

                        if (propertyName == "numberOfDevices")
                        {
                            numberOfDevices = property["Value"];
                        }
                    }

                    max7219 = new IotZoo::Max7219(deviceIndex, settings, mqttClient, getBaseTopic(), numberOfDevices, dataPin, clkPin, csPin);
                    if (nullptr != max7219)
                    {
                        Serial.println("Max7219 8x8 LED Matrix initialized.");
                    }
                }
#endif // USE_MAX7219

#ifdef USE_SWITCH
                if (deviceType == "Switch")
                {
                    int switchPin = arrPins[0]["MicrocontrollerGpoPin"];
                    switches.emplace_back(deviceIndex, settings, mqttClient, getBaseTopic(), switchPin);
                    Serial.println("Switch initialized.");
                }
#endif // USE_SWITCH

