HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_KEYPAD
                if (deviceType == "Keypad 4x4")
                {
                    int column3Pin = arrPins[0]["MicrocontrollerGpoPin"];
                    int column2Pin = arrPins[1]["MicrocontrollerGpoPin"];
                    int column1Pin = arrPins[2]["MicrocontrollerGpoPin"];
                    int column0Pin = arrPins[3]["MicrocontrollerGpoPin"];
                    int row0Pin    = arrPins[4]["MicrocontrollerGpoPin"];
                    int row1Pin    = arrPins[5]["MicrocontrollerGpoPin"];
                    int row2Pin    = arrPins[6]["MicrocontrollerGpoPin"];
                    int row3Pin    = arrPins[7]["MicrocontrollerGpoPin"];

                    ButtonMatrix* buttonMatrix = new ButtonMatrix(deviceIndex, settings, mqttClient, getBaseTopic());
                    buttonMatrix->setRowPins(row0Pin, row1Pin, row2Pin, row3Pin);
                    buttonMatrix->setColPins(column0Pin, column1Pin, column2Pin, column3Pin);

                    buttonMatrixHandling.AddDevice(buttonMatrix);

                    Serial.println("Buttonmatrix initialized.");
                }
#endif // USE_KEYPAD

#ifdef USE_ANALOG_INPUT_PIN
                if (deviceType == "ADC")
                {
                    int   analogPin  = arrPins[0]["MicrocontrollerGpoPin"];
                    u16_t intervalMs = 1000;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];
                        if (propertyName == "Interval")
                        {
                            intervalMs = propertyValue.toInt();
                        }
                    }

                    if (analogPin != 32 && analogPin != 33 && analogPin != 34 && analogPin != 35 && analogPin != 36 && analogPin != 39)
                    {
                        Serial.println("Warning: analogPin " + String(analogPin) +
                                       " is not an ADC pin (34, 35, 36, 39 are valid ADC pins on ESP32)!");
                        mqttClient->publish(getBaseTopic() + "/error/" + String(deviceIndex),
                                            "Warning: pinAdc is not an ADC pin (32, 33 34, 35, 36, 39 are valid ADC pins on ESP32)!");
                        continue;
                    }
                    else
                    {
                        analogInputPins.emplace_back(deviceIndex, settings, mqttClient, getBaseTopic(), analogPin, intervalMs);
                        Serial.println("Analog Input Pin initialized on pin " + String(analogPin) + ".");
                    }
                }
#endif // USE_ANALOG_INPUT_PIN

#ifdef USE_STEPPER_MOTOR
                if (deviceType == "28BY48Stepper")
                {
                    int pin1 = arrPins[0]["MicrocontrollerGpoPin"];
                    int pin2 = arrPins[1]["MicrocontrollerGpoPin"];
                    int pin3 = arrPins[2]["MicrocontrollerGpoPin"];
                    int pin4 = arrPins[3]["MicrocontrollerGpoPin"];

                    stepperMotor = new StepperMotor(deviceIndex, settings, mqttClient, getBaseTopic(), pin1, pin2, pin3, pin4);

                    Serial.println("28BY48 Stepper initialized.");
                }
#endif // USE_STEPPER_MOTOR

#ifdef USE_HC_SR501
                // Add 1..3 HC-SR501 motion detectors.
                if (deviceType == "HC-SR501")
                {
                    int pinMotionDetector = arrPins[0]["MicrocontrollerGpoPin"];
                    motionDetectorsHrsc501Handling.addDevice(deviceIndex, settings, mqttClient, getBaseTopic(), pinMotionDetector);
                }
#endif // USE_HC_SR501

#ifdef USE_RD_03D
                if (deviceType == "Rd-03D")
                {
                    uint8_t pinRx = arrPins[0]["MicrocontrollerGpoPin"];
                    uint8_t pinTx = arrPins[1]["MicrocontrollerGpoPin"];

                    u_int16_t timeoutMillis          = 30000;
                    u_int16_t maxDistanceMillimeters = 60000;
                    bool      multiTargetMode        = false;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];

                        if (propertyName == "TimeoutMillis")
                        {
                            timeoutMillis = property["Value"];
                        }
                        else if (propertyName == "MaxDistanceMillimeters")
                        {
                            maxDistanceMillimeters = property["Value"];
                        }
                        else if (propertyName == "MultiTargetMode")
                        {
                            multiTargetMode = property["Value"];
                        }
                    }

                    rd03d = new Rd03D(deviceIndex, settings, mqttClient, getBaseTopic(), pinRx, pinTx, timeoutMillis, maxDistanceMillimeters,
                                      multiTargetMode);
                    Serial.print("Rd-03d configuration added! pinRx: " + String(pinRx) + ", pinTx: " + String(pinTx));
                    Serial.println(", TimeOutMillis: " + String(timeoutMillis) + ", MaxDistanceMillimeters: " + String(maxDistanceMillimeters));
                }
#endif // USE_RD_03D

#ifdef USE_LCD_160X
                // Add USE_LCD_160X display.
                if (deviceType == "LCD160x")
                {
                    Serial.println("Initializing LCD160x display.");
                    uint8_t columns    = 20;
                    uint8_t rows       = 4;
                    uint8_t i2cAddress = 0x27;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "Columns")
                        {
                            columns = std::stoi(propertyValue.c_str());
                        }
                        else if (propertyName == "Rows")
                        {
                            columns = std::stoi(propertyValue.c_str());
                        }
                        else if (propertyName == "I2CAddress")
                        {
                            i2cAddress = std::stoi(propertyValue.c_str());
                        }
                    }

                    lcdDisplay = new LcdDisplay(deviceIndex, settings, mqttClient, getBaseTopic(),
                                                i2cAddress, // set the LCD address to 0x27
                                                columns, rows);

                    Serial.println("LCD160x configuration added! I2C-Address: " + String(i2cAddress));
                }
#endif // USE_LCD_160X

#ifdef USE_OLED_SSD1306

                // SDA must be connected to pin 21 and SCL to pin 22.
                if (deviceType == "OLED_SSD1306")
                {
                    Serial.println("Initializing OLED_SSD1306 display.");
                    // u_int8_t sclPin = arrPins[0]["MicrocontrollerGpoPin"];
                    // u_int8_t sdaPin = arrPins[1]["MicrocontrollerGpoPin"];
                    u_int8_t i2cAddress = 0x3C;

                    oled1306 = new OledSsd1306Display(deviceIndex, settings, mqttClient, getBaseTopic(), i2cAddress);
                    Serial.println("Oled display SSD1306 initialized! I2C-Address: " + String(i2cAddress));
                }
#endif // USE_OLED_SSD1306

#ifdef USE_DS18B20
                if (deviceType == "DS18B20")
                {

                    int datPin = arrPins[0]["MicrocontrollerGpoPin"];

                    int transmissionInterval = 20000;
                    int resolution           = 11;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];
                        if (propertyName == "Interval")
                        {
                            transmissionInterval = std::stoi(propertyValue.c_str());
                        }
                        else if (propertyName == "Resolution")
                        {
                            resolution = std::stoi(propertyValue.c_str());
                        }
                        if (transmissionInterval < 5000)
                        {
                            transmissionInterval = 5000;
                        }
                        if (transmissionInterval > 900000) // 15 min
                        {
                            transmissionInterval = 900000;
                        }
                        if (resolution < 9)
                        {
                            resolution = 9;
                        }
                        if (resolution > 11)
                        {
                            resolution = 11;
                        }
                    }

