HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
                    Serial.println("TM1637_4 display with deviceIndex " + String(deviceIndex) + " initialized! CLK Pin is " + String(clkPin) +
                                   ", DIO Pin is " + String(dioPin) + ", FlipDisplay: " + String(flipDisplay));
                }
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
                if (deviceType == "TM1637_6")
                {
                    Serial.println("TM1637_6 display");
                    tm1637_6Handling = new TM1637_6_Handling();
                    int clkPin       = arrPins[0]["MicrocontrollerGpoPin"];
                    int dioPin       = arrPins[1]["MicrocontrollerGpoPin"];

                    bool   flipDisplay = false;
                    String serverDownText;
                    bool   enableServerDownText = false;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "flipDisplay")
                        {
                            propertyValue.toLowerCase();
                            flipDisplay = propertyValue == "true";
                        }
                        else if (propertyName == "serverDownText")
                        {
                            propertyValue.toLowerCase();
                            serverDownText = propertyValue;
                        }
                        else if (propertyName == "enableServerDownText")
                        {
                            propertyValue.toLowerCase();
                            serverDownText       = propertyValue;
                            enableServerDownText = propertyValue == "true";
                        }
                    }
#ifdef USE_INTERNAL_MQTT
                    tm1637_6Handling->setInternalMqttClient(globalInternalMqttClient);
#endif // USE_INTERNAL_MQTT
                    DeviceBase& device = tm1637_6Handling->addDevice(getBaseTopic(), deviceIndex, clkPin, dioPin, flipDisplay, serverDownText);
                    device.setEnableServerDownText(enableServerDownText);

                    Serial.println("TM1637_6 display initialized! CLK Pin is " + String(clkPin) + ", DIO Pin is " + String(dioPin));
                }
#endif // USE_TM1637_6

#ifdef USE_LED_AND_KEY
                if (deviceType == "TM1638")
                {
                    Serial.println("TM1638_8 display");

                    int strobePin = arrPins[0]["MicrocontrollerGpoPin"];
                    int clkPin    = arrPins[1]["MicrocontrollerGpoPin"];
                    int dioPin    = arrPins[2]["MicrocontrollerGpoPin"];

                    tm1638 = new TM1638(deviceIndex, settings, mqttClient, getBaseTopic(), strobePin, clkPin, dioPin);

                    Serial.println("TM1638 display initialized! Strobe Pin is " + String(strobePin) + ", CLK Pin is " + String(clkPin) +
                                   ", DIO Pin is " + String(dioPin));
                }
#endif // USE_LED_AND_KEY

#ifdef USE_REMOTE_GPIOS
                if (deviceType == "Remote GPIO")
                {
                    Serial.println("Remote GPIO");

                    int gpioPin = arrPins[0]["MicrocontrollerGpoPin"];
                    remoteGpios.emplace_back(deviceIndex, settings, mqttClient, getBaseTopic(), gpioPin);
                    Serial.println("Remote GPIO PIN configuration loaded! Pin is " + String(gpioPin) + ". Size remoteGpios: " + remoteGpios.size());
                }
#endif // USE_REMOTE_GPIOS

#ifdef USE_TRAFFIC_LIGHT_LEDS
                if (deviceType == "LEDS Traffic Light")
                {
                    Serial.println("LEDS Traffic Light");

                    int gpioLedRed    = -1;
                    int gpioLedYellow = -1;
                    int gpioLedGreen  = -1;

                    for (JsonVariant property : arrPins)
                    {
                        String propertyName  = property["PinName"];
                        String propertyValue = property["MicrocontrollerGpoPin"];
                        Serial.println("propertyName: " + propertyName + ", propertyValue: " + propertyValue);

                        if (propertyName == "R")
                        {
                            gpioLedRed = std::stoi(propertyValue.c_str());
                            Serial.println("Red Gpio: " + gpioLedRed);
                        }
                        else if (propertyName == "Y")
                        {
                            gpioLedYellow = std::stoi(propertyValue.c_str());
                            Serial.println("Yellow Gpio: " + gpioLedYellow);
                        }
                        else if (propertyName == "G")
                        {
                            gpioLedGreen = std::stoi(propertyValue.c_str());
                            Serial.println("Green Gpio: " + gpioLedGreen);
                        }
                    }

                    if (gpioLedRed != -1 && gpioLedYellow != -1 && gpioLedGreen != -1)
                    {
                        trafficLightLeds.emplace_back(deviceIndex, settings, mqttClient, getBaseTopic(), gpioLedRed, gpioLedYellow, gpioLedGreen);
                    }
                }
#endif // USE_TRAFFIC_LIGHT_LEDS

#ifdef USE_HW040
                if (deviceType == "HW-040")
                {
                    Serial.println("HW-040 rotary encoder");
                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dtPin  = arrPins[1]["MicrocontrollerGpoPin"];
                    int swPin  = arrPins[2]["MicrocontrollerGpoPin"];

                    int  boundaryMinValue = 0;
                    int  boundaryMaxValue = 255;
                    bool circleValues     = false;
                    int  acceleration     = 250;
                    int  encoderSteps     = 2;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "BoundaryMinValue")
                        {
                            boundaryMinValue = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "BoundaryMaxValue")
                        {
                            boundaryMaxValue = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "Acceleration")
                        {
                            acceleration = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "EncoderSteps")
                        {
                            encoderSteps = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "CircleValue")
                        {
                            circleValues = propertyValue == "true";
                        }
                    }

                    hw040Handling.addDevice(deviceIndex, settings, mqttClient, getBaseTopic(), boundaryMinValue, boundaryMaxValue, circleValues,
                                            acceleration, encoderSteps, clkPin, dtPin, swPin, -1);
                    Serial.println("HW-040 rotary encoder initialized! CLK Pin is " + String(clkPin) + ", DT Pin is " + String(dtPin) +
                                   ", MS Pin is " + String(swPin) + ", boundaryMinValue is " + String(boundaryMinValue) + ", boundaryMaxValue is " +
                                   String(boundaryMaxValue) + ", acceleration is " + String(acceleration) + ", circleValues is " +
                                   String(circleValues) + ", encoderSteps is " + String(encoderSteps));
                }
#endif // USE_HW040

