HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_BLE_HEART_RATE_SENSOR
                if (deviceType == "BleHeartRateSensor")
                {
                    uint8_t advertisingTimeoutSeconds = 30;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName = property["Name"];

                        if (propertyName == "AdvertisingTimeoutSeconds")
                        {
                            advertisingTimeoutSeconds = property["Value"].as<uint8_t>();
                        }
                    }

                    heartRateSensor = new HeartRateSensor(deviceIndex, settings, mqttClient, getBaseTopic(), advertisingTimeoutSeconds);
#ifdef USE_INTERNAL_MQTT
                    heartRateSensor->setTopicLinks(*topicLinks);
                    heartRateSensor->setInternalMqttClient(globalInternalMqttClient);
#endif
                    connectToHeartRateSensor(advertisingTimeoutSeconds);
                }
#endif // USE_BLE_HEART_RATE_SENSOR
            }
        }
    }
}

#if defined(USE_REST_SERVER)
#if defined(USE_MQTT)
void handleGetAlive()
{
    debug("Get alive");
    String json = createAliveJson();
    webServer.send(200, "application/json", json.c_str());
}
#endif // USE_MQTT
#endif // USE_REST_SERVER

#ifdef USE_REST_SERVER
/// @brief http get delivers the configuration of the connected sensors/devices. http://raspberrypi/deviceConfig
void handleGetDeviceConfig()
{
    debug("GET device config");
    String json = settings->loadDeviceConfigurations();
    webServer.send(200, "application/json", json.c_str());
}

/// @brief
/// @param index Index of the GPIO pin.
/// @return State of the GPIO pin at Index @see index.
void handleGetGpioState(int index)
{
#ifdef USE_REMOTE_GPIOS
    auto remoteGpio = remoteGpios.begin();
    std::advance(remoteGpio, index);
    int data = remoteGpio->readDigitalValue();
    Serial.println("GPIO Pin " + String(remoteGpio->getGpioPin()) + " is in state " + String(data));
    webServer.send(200, "text/plain", String(data));
#endif
}

void handleGetGpio0State()
{
    handleGetGpioState(0);
}

void handleGetGpio1State()
{
    handleGetGpioState(1);
}

void handleGetGpio2State()
{
    handleGetGpioState(2);
}

void handleGetGpio3State()
{
    handleGetGpioState(3);
}

void handleGetGpio4State()
{
    handleGetGpioState(4);
}

#ifdef USE_REST_SERVER

/// @brief Blazor app sends device config.
void handlePostDeviceConfig()
{
    debug("Received device config (POST).");
    if (webServer.hasArg("plain") == false)
    {
        // handle error here
        Serial.println("rest problem");
    }
    String body = webServer.arg("plain");
    settings->saveDeviceConfigurations(body);
    Serial.println(body);
    // Respond to the client
    webServer.send(200, "application/json", "{}");
}

/// @brief Blazor app sends microcontroller config.
void handlePostMicrocontrollerConfig()
{
    debug("Received microcontroller config (POST).");

    if (webServer.hasArg("plain") == false)
    {
        // handle error here
        Serial.println("rest problem");
    }
    String body = webServer.arg("plain");
    Serial.println(body);
    // JSON data buffer
    DynamicJsonDocument jsonDocument(1024); // on heap
    if (!deserializeStaticJsonAndPublishError(jsonDocument, body))
    {
        return;
    }

    String mqttBrokerIp  = jsonDocument["IpMqttBroker"];
    String projectName   = jsonDocument["ProjectName"];
    String namespaceName = jsonDocument["NamespaceName"];

    debug("MqttBrokerIp: " << mqttBrokerIp);
    debug("Project: " << projectName);
    if (!settings->setMqttBrokerIp(mqttBrokerIp))
    {
        debug("MqttBrokerIp not saved!");
    }
    if (!settings->setNamespaceName(namespaceName))
    {
        debug("NamespaceName not saved!");
    }
    if (!settings->setProjectName(projectName))
    {
        debug("ProjectName not saved!");
    }
    // Respond to the client
    webServer.send(200, "application/json", "{}");

    doRestart = true;
}

#endif

void connectToWiFi()
{
    debug("Connecting to " << ssid);

    WiFi.begin(ssid, password);

    WiFi.setAutoReconnect(true);

    Serial.print("Connected. IP: ");
    Serial.println(WiFi.localIP());
    Serial.println("AutoReconnect: " + String(WiFi.getAutoReconnect()));
}
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
/// @brief Callback from the heart rate sensor (heart rate changed)
/// @param pBLERemoteCharacteristic
/// @param pData heartRate/Pulse
/// @param length
/// @param isNotify
void notifyCallbackHeartRate(NimBLERemoteCharacteristic* pBLERemoteCharacteristic, uint8_t* data, size_t length, bool isNotify)
{
    if (data[1] > 0)
    {
        Serial.println("Pulse: " + String(data[1]));
    }

#ifdef USE_INTERNAL_MQTT
    {
        InternalMqttClient* internalMqttClient = heartRateSensor->getInternalMqttClient();
        if (nullptr != internalMqttClient)
        {
            debug("Count of TopicLinks: " + String(heartRateSensor->getTopicLinks().size()));
            // Has an internal component interest on counter changes?
            for (auto& topicLink : heartRateSensor->getTopicLinks())
            {
                debug("topicLink.TriggeringTopic: " + topicLink.TriggeringTopic);
                if (topicLink.TriggeringTopic.equalsIgnoreCase(getBaseTopic() + "/pulse/" + String(heartRateSensor->getDeviceIndex())))
                {
                    topicLink.Payload = String(data[1]).c_str();
                    internalMqttClient->publish(topicLink);
                }
            }
        }
    }
#endif // USE_INTERNAL_MQTT

#if defined(USE_MQTT)
    String topic = getBaseTopic() + "/pulse/0";
    mqttClient->publish(topic.c_str(), String(data[1]).c_str()); // Pulse ❤️
#endif
}

void connectToHeartRateSensor(int advertisingTimeout)
{
    String topic = getBaseTopic() + "/pulse/0/scan_started";

    mqttClient->publish(topic, "BLE scan started to find advertising heart rate sensor. Timeout is set to " + String(advertisingTimeout) + " s.");

    if (nullptr != heartRateSensor)
    {
        heartRateSensor->setup(notifyCallbackHeartRate, // Callback method, called on heart rate received
                               advertisingTimeout);     // Scan duration
    }
}
#endif // USE_BLE_HEART_RATE_SENSOR

// ------------------------------------------------------------------------------------------------
void setup()
{
    Serial.begin(115200);
    debug("*** SETUP ***");

    pinMode(LED_BUILTIN, OUTPUT);

    randomSeed(micros());

    macAddress = getMacAddress();

#ifdef ERASE_FLASH
    // helps if the config is destroyed ...
    nvs_flash_erase(); // erase the NVS partition and...
    nvs_flash_init();  // initialize the NVS partition.
    Serial.println("Flash is now empty.");
#endif
    settings = new Settings();

#ifdef ERASE_FLASH
    while (true)
    {
        sleep(1000);
    }

#endif

