HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#if defined(USE_REST_SERVER)
    connectToWiFi();
    // Routing REST Server

    // REST interface
#if defined(USE_MQTT)
    webServer.on("/alive", HTTP_GET, handleGetAlive);
#endif
    webServer.on("/deviceConfig", HTTP_GET, handleGetDeviceConfig);
    webServer.on("/deviceConfig", HTTP_POST, handlePostDeviceConfig);
    webServer.on("/microcontrollerConfig", HTTP_POST, handlePostMicrocontrollerConfig);
    webServer.on("/gpio/0", HTTP_GET, handleGetGpio0State);
    webServer.on("/gpio/1", HTTP_GET, handleGetGpio1State);
    webServer.on("/gpio/2", HTTP_GET, handleGetGpio2State);
    webServer.on("/gpio/3", HTTP_GET, handleGetGpio3State);
    webServer.on("/gpio/4", HTTP_GET, handleGetGpio4State);
    webServer.begin();
#endif

#ifdef USE_INTERNAL_MQTT
    internalBroker           = new InternalMqttBroker(1884);
    globalInternalMqttClient = new InternalMqttClient(internalBroker, "id");
#endif // USE_INTERNAL_MQTT

#ifdef USE_TM1637_4
    if (nullptr != tm1637_4Handling)
    {
        tm1637_4Handling->setup();
    }
#endif

#ifdef USE_TM1637_6
    if (nullptr != tm1637_6Handling)
    {
        tm1637_6Handling->setup();
    }
#endif

#if defined(USE_MQTT)
    char* mqttClientName = new char[18]();

    for (int i = 0; i < 17; i++)
    {
        mqttClientName[i] = macAddress[i];
    }

    String strMqttBrokerIp = settings->getMqttBrokerIp(MqttBrokerIpFallback);
    Serial.println("MQTT Broker Ip: " + strMqttBrokerIp);
    char* mqttBrokerIp = new char[18]();
    for (int i = 0; i < 17; i++)
    {
        mqttBrokerIp[i] = strMqttBrokerIp[i];
    }

    mqttClient = new MqttClient(mqttClientName, ssid, password, mqttBrokerIp, nullptr, nullptr, 1883);

    Serial.println("BaseTopic: " + getBaseTopic());
#endif
    makeInstanceConfiguredDevices();
    lastAliveTime = millis() - settings->getAliveIntervalMillis();

#ifdef USE_HB0014
    pinMode(digitalPinInfraredLed, INPUT);
#ifdef USE_OLED_SSD1306
    if (nullptr != oled1306)
    {
        oled1306->setTextLine(1, "?");
        oled1306->setTextLine(2, "Watt");
    }
#endif
#endif
}

#ifdef USE_MQTT

void publishViaMqtt(const String& topicName, const String& payload)
{
    Serial.println(topicName);
    Serial.println(payload);
    mqttClient->publish(topicName, payload);
}
#endif

/// @brief Register all from this microcontroller supported topics at the IOTZOO client.
void registerTopics()
{
#ifdef USE_MQTT
    Serial.println("Register Known Topics at the IOTZOO client.");
    if (!mqttClient->isConnected())
    {
        return;
    }

    String lastWillTopic = getBaseTopic() + "/terminated";
    mqttClient->enableLastWillMessage(lastWillTopic.c_str(), "SHUTDOWN", 0);

    // so now the IOTZOO client knows this microcontroller.
    // ... let's tell it more about the connected devices and what you can do with it...
    std::vector<Topic> topics{};

    topics.emplace_back(getBaseTopic() + "/register_microcontroller", "Registers all the known topics of the microcontroller.",
                        MessageDirection::IotZooClientInbound);
    // necessary? register_microcontroller should be enough.
    topics.emplace_back(getBaseTopic() + "/started", "Microcontroller started", MessageDirection::IotZooClientInbound);

    // Alive message of the microcontroller
    topics.emplace_back(getBaseTopic() + "/alive", "Alive message of the microcontroller", MessageDirection::IotZooClientInbound);

    // How should the device send alive messages
    topics.emplace_back(getBaseTopic() + "/alive_config", "{\"aliveIntervalMs\": 15000, \"aliveAckLedMode\": 2}",
                        MessageDirection::IotZooClientInbound);

    // Acknowledge fo the alive message from the IotZooClient.
    topics.emplace_back(getBaseTopic() + "/alive_ack", "Alive message of the microcontroller", MessageDirection::IotZooClientOutbound);

    topics.emplace_back(getBaseTopic() + "/terminated", "Microcontroller terminated!", MessageDirection::IotZooClientInbound);

    // settings
    if (settings != nullptr)
    {
        topics.emplace_back(getBaseTopic() + "/settings/load", "Loads data with by the key given in the payload",
                            MessageDirection::IotZooClientOutbound);
        // answer to /settings/load
        topics.emplace_back(getBaseTopic() + "/settings/key", "Answer of /load in json format {\"key\": \"data\"}",
                            MessageDirection::IotZooClientInbound);

        topics.emplace_back(getBaseTopic() + "/settings/save", "{\"key\": \"data\"}", MessageDirection::IotZooClientOutbound);
    }
#ifdef USE_BLE_HEART_RATE_SENSOR
    if (nullptr != heartRateSensor)
    {
        heartRateSensor->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_STEPPER_MOTOR
    if (nullptr != stepperMotor)
    {
        stepperMotor->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_BUTTON
    buttonHandling.addMqttTopicsToRegister(&topics);
#endif

#ifdef USE_KY025
    if (nullptr != ky025)
    {
        ky025->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_BUZZER
    if (nullptr != buzzer)
    {
        buzzer->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_SWITCH
    for (auto& buttonSwitch : switches)
    {
        buttonSwitch.addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_REMOTE_GPIOS
    for (auto& remoteGpio : remoteGpios)
    {
        remoteGpio.addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_LCD_160X
    if (nullptr != lcdDisplay)
    {
        lcdDisplay->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_OLED_SSD1306
    if (nullptr != oled1306)
    {
        oled1306->addMqttTopicsToRegister(&topics);
    }
#endif // USE_OLED_SSD1306

#ifdef USE_TM1637_4
    if (nullptr != tm1637_4Handling)
    {
        tm1637_4Handling->addMqttTopicsToRegister(&topics);
    }
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
    if (nullptr != tm1637_6Handling)
    {
        tm1637_6Handling->addMqttTopicsToRegister(&topics);
    }
#endif // USE_TM1637_6

#ifdef USE_HT1621
    if (nullptr != ht1621)
    {
        ht1621->addMqttTopicsToRegister(&topics);
    }
#endif // USE_HT1621

#ifdef USE_MAX7219
    if (nullptr != max7219)
    {
        max7219->addMqttTopicsToRegister(&topics);
    }
#endif // USE_MAX7219

#ifdef USE_HW040
    hw040Handling.addMqttTopicsToRegister(&topics);
#endif // USE_HW040

#ifdef USE_HC_SR501
    motionDetectorsHrsc501Handling.addMqttTopicsToRegister(&topics);
#endif // USE_HC_SR501

#ifdef USE_RD_03D
    if (nullptr != rd03d)
    {
        rd03d->addMqttTopicsToRegister(&topics);
    }
#endif // USE_RD_03D

#ifdef USE_LED_AND_KEY
    if (nullptr != tm1638)
    {
        tm1638->addMqttTopicsToRegister(&topics);
    }
#endif // USE_LED_AND_KEY

