HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
#ifdef USE_KEYPAD
    buttonMatrixHandling.addMqttTopicsToRegister(&topics);
#endif // USE_KEYPAD

#ifdef USE_DS18B20
    if (nullptr != ds18B20SensorManager)
    {
        ds18B20SensorManager->addMqttTopicsToRegister(&topics);
    }
#endif // USE_DS18B20

#ifdef USE_HW507
    if (nullptr != hw507HumiditySensor)
    {
        hw507HumiditySensor->addMqttTopicsToRegister(&topics);
    }
#endif // USE_HW507

#ifdef USE_WS2818
    if (nullptr != ws2812)
    {
        ws2812->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_AUDIO_STREAMER
    if (nullptr != audioStreamer)
    {
        audioStreamer->addMqttTopicsToRegister(&topics);
    }
#endif

#ifdef USE_TRAFFIC_LIGHT_LEDS
    for (auto& trafficLight : trafficLightLeds)
    {
        trafficLight.addMqttTopicsToRegister(&topics);
    }
#endif

    pushTopicsToIotZooClient(topics);
#endif // USE_MQTT
    topicsRegistered = true;
}

/// @brief Called when the IotZoo Client has not responded to the alive message.
void onIotZooClientUnavailable()
{
    Serial.println("*** IoT-Zoo client is unavailable! Please start it! ***");

    String jsonMicrocontroller = serializeMicrocontroller();

    mqttClient->publish("i_am_lost", jsonMicrocontroller);
    // server dead?
#ifdef USE_TM1637_4
    if (nullptr != tm1637_4Handling)
    {
        tm1637_4Handling->onIotZooClientUnavailable();
    }
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
    if (nullptr != tm1637_6Handling)
    {
        tm1637_6Handling->onIotZooClientUnavailable();
    }
#endif // USE_TM1637_6

#ifdef USE_LED_AND_KEY
    if (nullptr != tm1638)
    {
        tm1638->onIotZooClientUnavailable();
    }
#endif // USE_LED_AND_KEY

#ifdef USE_HT1621
    if (nullptr != ht1621)
    {
        ht1621->onIotZooClientUnavailable();
    }
#endif

#ifdef USE_OLED_SSD1306
    if (nullptr != oled1306)
    {
        oled1306->onIotZooClientUnavailable();
    }
#endif

#ifdef USE_LCD_160X
    if (nullptr != lcdDisplay)
    {
        lcdDisplay->onIotZooClientUnavailable();
    }
#endif

#ifdef USE_STEPPER_MOTOR
    if (nullptr != stepperMotor)
    {
        stepperMotor->onIotZooClientUnavailable();
    }
#endif
}

// ------------------------------------------------------------------------------------------------
// The loop.
// ------------------------------------------------------------------------------------------------
void loop()
{
    try
    {
        if (WiFi.status() != WL_CONNECTED)
        {
            debug("🛜 🚫");
        }
        else
        {
            if (DebugHelper::debugLevel >= 3)
            {
                debug("🛜 ✅");
            }
        }

#ifdef USE_INTERNAL_MQTT
        internalBroker->loop();
#endif // USE_INTERNAL_MQTT

        lastLoopStartTime = millis();

        loopCounter++;

        if (doRestart)
        {
            restart();
        }

#if defined(USE_MQTT)
        mqttClient->loop();
#ifndef USE_INTERNAL_MQTT
        if (millis() - lastLoopStartTime > 10000)
        {
            Serial.print("BROKEN MQTT");
            restart();
        }
#endif
        if (!mqttClient->isConnected())
        {
            debug("⚠" << mqttClient->getConnectionEstablishedCount() << _EndLineCode::endl);
            // delay(200);
        }

        if (!topicsRegistered)
        {
            registerTopics();
            String topic = getBaseTopic() + "/started";
            mqttClient->publish(topic, "STARTED");
        }
#endif

#ifdef USE_BLE_HEART_RATE_SENSOR
        if (nullptr != heartRateSensor)
        {
            heartRateSensor->loop();
        }
#endif // USE_BLE_HEART_RATE_SENSOR

#ifdef USE_BUTTON
        buttonHandling.loop();
#endif

#ifdef USE_ANALOG_INPUT_PIN
        for (auto& analogInputPin : analogInputPins)
        {
            analogInputPin.loop();
        }
#endif // USE_ANALOG_INPUT_PIN

#ifdef USE_KY025
        if (nullptr != ky025)
        {
            ky025->loop();
        }
#endif // USE_KY025

        // {
        //     TopicLink topicLink("", "iotzoo/picea/esp32/e4:65:b8:b0:45:b4/tm1637_4/0/number");
        //     topicLink.Payload     = String(loopCounter).c_str();
        //     InternalMqttError err = globalInternalMqttClient->publish(topicLink);
        //     globalInternalMqttClient->loop();
        // }

#ifdef USE_AUDIO_STREAMER
        if (nullptr != audioStreamer)
        {
            audioStreamer->loop();
        }
#endif

#ifdef USE_WS2818
        if (nullptr != ws2812)
        {
            ws2812->loop();
        }
#endif

#ifdef USE_HW507
        if (nullptr != hw507HumiditySensor)
        {
            hw507HumiditySensor->loop();
        }
#endif

#ifdef USE_GPS
        if (nullptr != gps)
        {
            gps->loop();
        }
#endif

#ifdef USE_SWITCH
        for (auto& buttonSwitch : switches)
        {
            buttonSwitch.loop();
        }
#endif

#ifdef USE_LED_AND_KEY
        if (nullptr != tm1638)
        {
            tm1638->loop();
        }
#endif // USE_LED_AND_KEY

#ifdef USE_REST_SERVER
        webServer.handleClient();
#endif

        // >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
        // The preconditions are fulfilled (MQTT connected).

#ifdef USE_HW040
        hw040Handling.loop();
#endif

#ifdef USE_STEPPER_MOTOR
        if (nullptr != stepperMotor)
        {
            stepperMotor->loop();
        }
#endif

#ifdef USE_DS18B20
        if (nullptr != ds18B20SensorManager)
        {
            ds18B20SensorManager->loop();
        }
#endif // USE_DS18B20

#ifdef USE_HB0014
        digitalValueInfrared = digitalRead(digitalPinInfraredLed);

        if (digitalValueInfrared == HIGH && digitalValueOldInfrared == LOW)
        {
            long diff = millis() - lastMillisInfrared;
#ifdef USE_OLED_SSD1306
            if (nullptr != oled1306)
            {
                oled1306->setTextLine(3, String(diff) + " ms");
            }
#endif
            if (diff > 30)
            {
                // Umrechnen in Watt

                // 10000 Impulse entsprechen 1 KW/h.

